# <p style="background-color:#2e2b5f;font-family:Creepster,cursive;color:#ffffff;font-size:150%;text-align:center;border-radius:10px 10px;">👻 La Maldición del Dataset Perdido 🎃</p>
---

[![Banner-Maldici-n.png](https://i.postimg.cc/FRY3zfqR/Banner-Maldici-n.png)](https://postimg.cc/sQRv023d)

<div class="alert alert-block alert-info" style="margin-top: 20px">

<font size = 3>
    
1. <a href="#sec_1">Introducción</a>  
2. <a href="#sec_2">Exploración del set de datos</a>  
3. <a href="#sec_3">Selección de Muestras</a>  
4. <a href="#sec_4">Pre-selección de variables</a>  
5. <a href="#sec_5">Preparación de datos</a>
6. <a href="#sec_6">Modelo de regresión Lineal</a>  
7. <a href="#sec_7">Métricas de desempeño</a> 
8. <a href="#sec_8">Conclusiones y Recomendaciones</a>     

 
</font>
</div>

In [1]:
import pandas as pd

In [29]:
df =  pd.read_csv('DMC_Concurso_Dataset_Perdido.csv', sep = ';')

In [30]:
df

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20734,52,management,married,secondary,no,-892,yes,no,cellular,13,aug,295,2,-1,0,unknown,no
20735,51,admin.,married,secondary,no,21,no,yes,cellular,13,aug,157,2,-1,0,unknown,no
20736,35,technician,married,secondary,no,-180,no,yes,cellular,13,aug,823,2,-1,0,unknown,yes
20737,51,admin.,married,secondary,no,79,no,no,cellular,13,aug,89,2,-1,0,unknown,no
20738,31,entrepreneur,single,tertiary,yes,-405,yes,yes,cellular,13,aug,703,2,-1,0,unknown,yes

In [31]:
df =  df.drop_duplicates()

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20738 entries, 0 to 20738
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        20738 non-null  int64
 1   job        20738 non-null  object
 2   marital    20738 non-null  object
 3   education  20738 non-null  object
 4   default    20738 non-null  object
 5   balance    20738 non-null  int64
 6   housing    20738 non-null  object
 7   loan       20738 non-null  object
 8   contact    20738 non-null  object
 9   day        20738 non-null  int64
 10  month      20738 non-null  object
 11  duration   20738 non-null  int64
 12  campaign   20738 non-null  int64
 13  pdays      20738 non-null  int64
 14  previous   20738 non-null  int64
 15  poutcome   20738 non-null  object
 16  y          20738 non-null  object
dtypes: int64(7), object(10)
memory usage: 2.8+ MB

In [33]:
df['job'].value_counts()

job
blue-collar       5413
management        3739
technician        3319
admin.            2349
services          2183
retired            841
entrepreneur       752
housemaid          685
self-employed      664
unemployed         474
unknown            159
student            151
administrative       3
Management           2
MANAGEMENT           1
Self-employed        1
Services             1
Retired              1
Name: count, dtype: int64

In [24]:
columnas =  df.select_dtypes(include = 'object').columns.to_list()
columnas
def minisculas(x):
    x = x.lower()
    return x
for i in columnas:
    df[i] = df[i].apply(minisculas)

C:\Users\EQUIPO\AppData\Local\Temp\ipykernel_17528\533480317.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[i] = df[i].apply(minisculas)

In [26]:
df['job'].value_counts()

job
blue-collar       5413
management        3742
technician        3319
admin.            2349
services          2184
retired            842
entrepreneur       752
housemaid          685
self-employed      665
unemployed         474
unknown            159
student            151
administrative       3
Name: count, dtype: int64

In [27]:
df['job'] =  df['job'].replace({'admin.':'administrative'})

C:\Users\EQUIPO\AppData\Local\Temp\ipykernel_17528\3213829861.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['job'] =  df['job'].replace({'admin.':'administrative'})

In [28]:
df['job'].value_counts()

job
blue-collar       5413
management        3742
technician        3319
administrative    2352
services          2184
retired            842
entrepreneur       752
housemaid          685
self-employed      665
unemployed         474
unknown            159
student            151
Name: count, dtype: int64

In [22]:
columnas =  df.select_dtypes(include = 'object').columns.to_list()
columnas

['job',
 'marital',
 'education',
 'default',
 'housing',
 'loan',
 'contact',
 'month',
 'poutcome',
 'y']

In [18]:
df['job'].value_counts()

job
blue-collar       5413
management        3739
technician        3319
admin.            2349
services          2183
retired            841
entrepreneur       752
housemaid          685
self-employed      664
unemployed         474
unknown            159
student            151
administrative       3
Management           2
MANAGEMENT           1
Self-employed        1
Services             1
Retired              1
Name: count, dtype: int64

In [17]:
df['age'].value_counts()

age
31     849
35     848
32     834
36     825
37     790
34     773
33     749
39     740
38     709
30     698
40     683
41     670
42     642
44     628
45     625
46     581
43     576
29     549
47     536
49     523
51     501
48     492
50     492
52     463
28     459
53     453
57     431
56     417
55     416
27     414
59     403
54     395
58     377
26     366
60     306
25     261
24     105
23      72
22      31
61      25
21      16
20       9
530      1
490      1
123      1
332      1
311      1
399      1
Name: count, dtype: int64